MEXICO/V10-Run8/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//application     simpleFoam;
application     uRANSABLWFarmSolver;

//Time Control

startFrom       startTime;//latestTime;

startTime       0;

stopAt          endTime;

endTime         2.1;

deltaT          7e-4

//Data writing

writeControl    timeStep; //adjustableRunTime;

writeInterval   30;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

//Adjustable time step

ajustTimeStep    no;

//maxCo             0.75;

//maxDeltaT         25.0;

//Data reading

runTimeModifiable no;

startTimeMean   0.2;

startTimeCorr  0.3;


/* libs (
      "/home/cperalta/OF_211/NEW_LIBRARIES/lib/libuserTurbineModels.so"
      "/home/cperalta/OF_211/MYLIBRARIES/lib/myTurbulenceModelsAndWallFunctions.so"
      "/home/cperalta/OF_211/NEW_SOLVERS/lib/libSOFWAfiniteVolume.so"
    );
*/

// ************************************************************************* //
